#написати функцію add_one, яка приймає список із цифр, які у свою чергу є одним числом.
# До нього необхідно додати 1.
#необхідно з набору цифр, що входять до списку, отримати число, скласти його з 1
# і отриману суму, знову розбити на список із цифр.
#В результаті функція повертає список із цифр, що становлять значення суми.

def add_one(digits):
    number = int(''.join(map(str, digits)))
    number += 1
    return [int(x) for x in str(number)]
print(add_one ([1, 2, 3, 4]))
print(add_one ([9, 9,  9]))
print(add_one ([0]))
print(add_one ([9]))
print ("OK")