# Реалізуйте генераторну функцію (з використанням оператора yield),
# яка повертатиме по одному члену числової послідовності, закон якої
# задається за допомогою функції користувача. Крім цього параметром
# генераторної функції повинні бути значення першого члена прогресії та кількість членів,
# що видаються послідовності (n). Генератор повинен зупинити свою роботу з досягнення n-го члена.
def pow(x: int):
    return x ** 2

def some_gen(begin: int, end: int, func):
     """
     begin: перший елемент послідовності
     end: кількість елементів у послідовності
     func: функція, яка формує значення для послідовності
    """
     count=0
     while count < end:
         yield begin
         begin = func(begin)
         count += 1

from inspect import isgenerator
gen = some_gen(2, 4, pow)
print(isgenerator(gen))# == True, 'Test1'
print(list(gen))# == [2, 4, 16, 256], 'Test2'
print('OK')